{"config": [{"config": {"kernel_regularizer": null, "dtype": "float32", "name": "dense_1", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 12, "activity_regularizer": null, "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "batch_input_shape": [null, 8]}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_2", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 8, "activity_regularizer": null, "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_3", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "activity_regularizer": null, "activation": "sigmoid", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.5", "class_name": "Sequential"}